In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn import tree

In [8]:
df=pd.read_csv("Titanic.csv")
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [21]:
x=df.drop(['Survived', 'Parch','Name', 'Age', 'PassengerId', 'Ticket', 'Embarked', 'Cabin', 'SibSp'] ,axis='columns')
y=df['Survived']
x

     Pclass     Sex     Fare
1         1  female  71.2833
3         1  female  53.1000
6         1    male  51.8625
10        3  female  16.7000
11        1  female  26.5500
..      ...     ...      ...
871       1  female  52.5542
872       1    male   5.0000
879       1  female  83.1583
887       1  female  30.0000
889       1    male  30.0000

[183 rows x 3 columns]

In [22]:
le_sex=LabelEncoder()
x['Gender_id']=le_sex.fit_transform(x['Sex'])
X=x.drop(['Sex'],axis='columns')
X

     Pclass     Fare  Gender_id
1         1  71.2833          0
3         1  53.1000          0
6         1  51.8625          1
10        3  16.7000          0
11        1  26.5500          0
..      ...      ...        ...
871       1  52.5542          0
872       1   5.0000          1
879       1  83.1583          0
887       1  30.0000          0
889       1  30.0000          1

[183 rows x 3 columns]

In [23]:
model=tree.DecisionTreeClassifier()
model.fit(X,y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [24]:
model.score(X,y)

0.9289617486338798

In [25]:
model.predict(X)

array([1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
       0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1,
       1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1,
       1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 1])